In [2]:
import pandas as pd
import numpy as np
import matplotlib.pylab as plt
import seaborn as sns
plt.style.use("ggplot")

In [226]:
df = pd.read_excel("Ouse93-96 - Student.xlsx", sheet_name="1993-96")

In [228]:
df.shape
##we have 12 coloumn, and 1462 rows

(1462, 12)

In [230]:
df.head()

,Unnamed: 0,Mean Daily Flow - Cumecs,Unnamed: 2,Unnamed: 3,Unnamed: 4,Daily Rainfall Total - mm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,NaT,Crakehill,Skip Bridge,Westwick,Skelton,Arkengarthdale,East Cowton,Malham Tarn,Snaizeholme,NaN,NaN,You are to predict the mean daily flow at Skel...
1,1993-01-01,10.4,4.393,9.291,26.1,0,0,0,4,NaN,NaN,(Cumecs = m^3/s)
2,1993-01-02,9.95,4.239,8.622,24.86,0,0,0.8,0,NaN,NaN,NaN
3,1993-01-03,9.46,4.124,8.057,23.6,0,0,0.8,0,NaN,NaN,NaN
4,1993-01-04,9.41,4.363,7.925,23.47,2.4,24.8,0.8,61.6,NaN,NaN,NaN

In [232]:
data_series = df.iloc[:, 0]
df2 = df.drop(columns=["Unnamed: 0","Unnamed: 9", "Unnamed: 10", "Unnamed: 11"], axis = 1)
df2.head()

,Mean Daily Flow - Cumecs,Unnamed: 2,Unnamed: 3,Unnamed: 4,Daily Rainfall Total - mm,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,Crakehill,Skip Bridge,Westwick,Skelton,Arkengarthdale,East Cowton,Malham Tarn,Snaizeholme
1,10.4,4.393,9.291,26.1,0,0,0,4
2,9.95,4.239,8.622,24.86,0,0,0.8,0
3,9.46,4.124,8.057,23.6,0,0,0.8,0
4,9.41,4.363,7.925,23.47,2.4,24.8,0.8,61.6

In [240]:
rename_columns = ["Mean Daily Flow - Cumecs", "Mean Daily Flow - Cumecs", "Mean Daily Flow - Cumecs", "Mean Daily Flow - Cumecs", "Daily Rainfall Total - mm", "Daily Rainfall Total - mm", "Daily Rainfall Total - mm", "Daily Rainfall Total - mm"]
df2.columns = rename_columns
df2.head()

,Mean Daily Flow - Cumecs,Mean Daily Flow - Cumecs,Mean Daily Flow - Cumecs,Mean Daily Flow - Cumecs,Daily Rainfall Total - mm,Daily Rainfall Total - mm,Daily Rainfall Total - mm,Daily Rainfall Total - mm
0,Crakehill,Skip Bridge,Westwick,Skelton,Arkengarthdale,East Cowton,Malham Tarn,Snaizeholme
1,10.4,4.393,9.291,26.1,0,0,0,4
2,9.95,4.239,8.622,24.86,0,0,0.8,0
3,9.46,4.124,8.057,23.6,0,0,0.8,0
4,9.41,4.363,7.925,23.47,2.4,24.8,0.8,61.6

In [244]:
row2 = df2.iloc[0]
column_tuples = list(zip(rename_columns, row2))

In [248]:
multi_index =pd.MultiIndex.from_tuples(column_tuples, names=["Measure", "Station"])
df2.columns = multi_index
df2.head()

Measure Mean Daily Flow - Cumecs                                  \
Station                Crakehill  Skip Bridge  Westwick  Skelton
0                      Crakehill  Skip Bridge  Westwick  Skelton
1                           10.4        4.393     9.291     26.1
2                           9.95        4.239     8.622    24.86
3                           9.46        4.124     8.057     23.6
4                           9.41        4.363     7.925    23.47

Measure Daily Rainfall Total - mm
Station            Arkengarthdale  East Cowton  Malham Tarn  Snaizeholme
0                  Arkengarthdale  East Cowton  Malham Tarn  Snaizeholme
1                               0            0            0            4
2                               0            0          0.8            0
3                               0            0          0.8            0
4                             2.4         24.8          0.8         61.6

In [252]:
df2.insert(0, "Date", data_series)
df2.head()

Measure       Date Mean Daily Flow - Cumecs                                  \
Station                           Crakehill  Skip Bridge  Westwick  Skelton
0              NaT                Crakehill  Skip Bridge  Westwick  Skelton
1       1993-01-01                     10.4        4.393     9.291     26.1
2       1993-01-02                     9.95        4.239     8.622    24.86
3       1993-01-03                     9.46        4.124     8.057     23.6
4       1993-01-04                     9.41        4.363     7.925    23.47

Measure Daily Rainfall Total - mm
Station            Arkengarthdale  East Cowton  Malham Tarn  Snaizeholme
0                  Arkengarthdale  East Cowton  Malham Tarn  Snaizeholme
1                               0            0            0            4
2                               0            0          0.8            0
3                               0            0          0.8            0
4                             2.4         24.8          0.8         61.6